// Practice

//! 1.তুই score নামে একটা ভেরিয়েবল লিখ। এখন এইটা কীসের স্কোর, সেটা ভেরিয়েবলের নাম দেখে বুঝা যাচ্ছে না। তাই এই ভেরিয়েবল ডিক্লেয়ার করার ওপরে এক লাইন কমেন্ট লিখ। কমেন্টে থাকবে, এইটা কীসের স্কোর।
//? Ans:

//  My Assignment Average scoreCh
const score = 60;

//! 2. এখন radius নামে একটা ভেরিয়েবল লিখ। তারপর এইটা কীসের রেডিয়াস, সেটা বুঝানোর জন্য তিন লাইনের কমেন্ট লিখ। প্রত্যেক লাইনের আগে স্ল্যাশ চিহ্ন দিয়ে কমেন্ট লিখবি।
// Ans:

// website border radius
// radius
// kono kichuke rounded korte radius use kori
const radius = 20;

//! 3 তোর পছন্দের জামা কয়টা, সেটা নিয়ে dress নামে একটা ভেরিয়েবল ডিক্লেয়ার কর। তারপর সেটার ওপর মাল্টিলাইন কমেন্ট লিখ স্ল্যাশ এবং এস্টেরিস্ক চিহ্ন দিয়ে।
//? Ans:

/**
 *
 * my faverite dress T-shart
 * my faverite pollo t-shart
 *
 */
const dress = 6;

//! 4. তোকে একটা গিফট হিসেবে 100 টাকা দেওয়া হয়েছে, giftMoney নামে একটা ভেরিয়েবলে রাখ। তারপর কমেন্টে লিখবি, এই টাকা কী কারণে দেওয়া হয়েছে।
//? Ans:

// eid salami
// Done Yeah 100 Hunded taka 😀
const giftMoney = 100;

//! 5. তুই ঠিক করলি 7 ঘণ্টা পড়ালেখা করবি। studyTime নামে একটি ভেরিয়েবলে রাখ। তার ওপর চার-পাঁচ লাইনের কমেন্ট লিখ, এই 7 ঘণ্টার মধ্যে কোন কোন সাবজেক্টের কী কী জিনিস তুই কতক্ষণ ধরে পড়বি।
//? Ans:

/**
 *
 * Python 1 hours
 * Java 1 hours
 * Webdesigin 1 hours
 * Digital Electronics 1 hours
 * Business Communication 20 minit
 *
 */
const studyTime = 7;

//! 6. তোর মোবাইল পেমেন্টের জন্য sendMoney নামে একটি ভেরিয়েবল ডিক্লেয়ার কর। তার ওপর দুই লাইনের কমেন্ট লিখ, যাকে মানি সেন্ড করতেছস, সে কত টাকা পাবে, আর সার্ভিস ফি কত টাকা।
//? Ans:

/**
 * 1.Bkash charge = 1000  =>20tk
 * 1. Send Money = 2000 Tk
 * 2. Reseve Money = 1960 tk
 *
 */

const sendMoney = 2000;

//! 7. তুই অনলাইন থেকে একটা প্রোডাক্ট অর্ডার করছস। তোর কাছ থেকে মোট কত টাকা নিবে, সেটা pay নামে একটা ভেরিয়েবলে রাখ। তারপর ওপরে এক লাইন কমেন্ট লিখবি। এই টাকার মধ্যে প্রোডাক্টের দাম এবং ডেলিভারি ফি যোগ করা আছে।
//? Ans:

/**
 *
 * 1. Delevary charge = 80 tk
 * 2. Online order bkash charge = 20 tk chashbak = 10tk
 * 3. Product price = 1100 tk
 *
 */

const pay = 1200;
