/**
 *
উদাহরণ:
  const weight = 38;
  const price = 760;
  const year = 1865;
  const balance = 2000;
  const age = 14;
  * 
 সমান চিহ্নের বামপাশে যেটা আছে, সেটা হচ্ছে নাম বা ভেরিয়েবলের নাম, আর ডানপাশে যেটা রয়েছে, সেটা হচ্ছে মান বা ভ্যালু।
 
 *  
 */

// Problem For Practice

// 1. তোর জন্মসালটি একটা ভেরিয়েবলে রাখ।
// Ans:
const birthYear = 2007;

// 2.তোরা কয় ভাই-বোন, সেটা একটা ভেরিয়েবলে রাখ।
// Ans:
const brather = 2;
const sister = 0;

// 3.তোর ক্লাসে কতজন স্টুডেন্ট আছে, তাদের সংখ্যা দিয়ে students নামক একটা ভেরিয়েবল ডিক্লেয়ার কর।
// Ans:
const students = 70;

// 4.লাস্ট পরীক্ষায় কত নাম্বার পাইছিলি, সেটা দিয়ে marks নামক একটা ভেরিয়েবল ডিক্লেয়ার কর।
// Ans:
const marks = 60;

// 5.তোর বাসায় কয়টা রুম আছে, সেটা নিয়ে rooms নামক একটা ভেরিয়েবল ডিক্লেয়ার কর।
// Ans:
const rooms = 3;

// 6. তোর দৈনিক পড়াশোনার সময়কে ঘণ্টা হিসেবে একটি ভেরিয়েবলে রাখ।
// Ans:
const dailyStudyHours = 5;

// 7.তোর ফোন নাম্বারে যতগুলা ডিজিট বা অঙ্ক যোগ করে যোগফল total নামে একটা ভেরিয়েবলে রাখ।
// Ans:

const phoneNumber = 11;
const total = 0;

total = 1 + 2 + 3 + 4 + 5 + 6 + 7 + 8 + 9 + 10 + 11;
